# [ DataFrame 살펴보기]
    
* 데이터를 테이블 즉, 표 형태로 저장하는 자료구조
구성 : 행 + 열
생성 : pandas.DataFrame() 생성자 메서드

### (1) 모듈 로딩 ---------------------------------------------------

In [2]:
from pandas import DataFrame

### (2)데이터 준비 ----------------------------------------------

In [3]:
data = [ [11,22,33], [44, 55, 66],[77,88,99]]

### (3) DataFrame으로 저장 즉, DataFrame 객체 생성 ---------

In [4]:
df1 = DataFrame(data)
df1

    0   1   2
0  11  22  33
1  44  55  66
2  77  88  99

(4) DataFrame의 속성 읽기 => 객체변수명.속성명 -------

In [5]:
df1.index

RangeIndex(start=0, stop=3, step=1)

In [6]:
df1.columns

RangeIndex(start=0, stop=3, step=1)

In [7]:
df1.values

array([[11, 22, 33],
       [44, 55, 66],
       [77, 88, 99]], dtype=int64)

In [8]:
# 데이터가 저장된 표의 형태
df1.shape

(3, 3)

In [9]:
# 데이터의 차원정보 n-dimension
df1.ndim

2

In [10]:
# 컬럼별 데이터 타입/ data types of each columns
df1.dtypes

0    int64
1    int64
2    int64
dtype: object

(5) 원소 읽기 ==> 행과 열 지정 ===> 1개 원소

- 컬럼 즉 열 (column) 읽기 ==> 객체변수명[인덱스]

In [11]:
df1

    0   1   2
0  11  22  33
1  44  55  66
2  77  88  99

In [12]:
df1[0]

0    11
1    44
2    77
Name: 0, dtype: int64

In [13]:
df1[2]

0    33
1    66
2    99
Name: 2, dtype: int64

In [14]:
## 컬럼 변경 ------------------------------------
df1.columns=['A','B','C']
df1

    A   B   C
0  11  22  33
1  44  55  66
2  77  88  99

In [15]:
df1['A']

0    11
1    44
2    77
Name: A, dtype: int64

In [16]:
df1.A

0    11
1    44
2    77
Name: A, dtype: int64

In [17]:
df1.columns=[0,1,2]
df1

    0   1   2
0  11  22  33
1  44  55  66
2  77  88  99

In [18]:
df1[0]

0    11
1    44
2    77
Name: 0, dtype: int64

In [19]:
# 컬럼 레이블 설정 후 정수 인덱싱 불가!!
#df1.0

- 로우 즉 행 (row) 읽기 ==> 방법 2가지
    * 위치 인덱스로 읽기 : 객체변수명.iloc[인덱스]
    * 레이블 인덱스로 읽기 ; 객체변수명.loc[인덱스]

In [20]:
df1.index=['one','two','three']

In [21]:
df1

        0   1   2
one    11  22  33
two    44  55  66
three  77  88  99

In [35]:
df1.columns = ['하나','둘','셋']
# df1.loc['0']
df1['둘']

one      22
two      55
three    88
Name: 둘, dtype: int64

In [ ]:
df1.iloc[0]

0    11
1    22
2    33
Name: one, dtype: int64

In [ ]:
one = df1.loc['one']
type(one)

pandas.core.series.Series

In [ ]:
zero=df1.iloc[0]
type(zero)

pandas.core.series.Series

(6) 모든 원소를 한번에 한개씩만 출력

In [ ]:
df1

        0   1   2
one    11  22  33
two    44  55  66
three  77  88  99

- 객체변수명.iloc[행인덱스, 열인덱스] / - 객체변수명.loc[행레이블, 열인덱스 or 열레이블]

In [ ]:
#
df1.iloc[0,0], df1.iloc[0,2],df1.iloc[1,0],df1.iloc[1,2]

(11, 33, 44, 66)

In [ ]:
df1.loc['one',0], df1.loc['one',2],df1.loc['two',0], df1.loc['two',1]

(11, 33, 44, 55)

In [ ]:
# 컬럼명 변경 => 객체변수명.columns = 새로운 컬럼명
df1.columns = ['A','B','C']
df1

        A   B   C
one    11  22  33
two    44  55  66
three  77  88  99

In [ ]:
df1.loc['one','B'], df1.loc['two','C']

(22, 66)

In [ ]:
df1.iloc[1,2]

66

In [ ]:
df1.iloc[0][1], df1.iloc[1][2]

(22, 66)

In [ ]:
zero = df1.iloc[0]
zero

A    11
B    22
C    33
Name: one, dtype: int64

In [ ]:
b=df1['B']
b

one      22
two      55
three    88
Name: B, dtype: int64

In [ ]:
df1.index, df1.columns

(Index(['one', 'two', 'three'], dtype='object'),
 Index(['A', 'B', 'C'], dtype='object'))

In [ ]:
df1.shape[0], df1.shape[1]

(3, 3)

 - iloc를 활용한 모든 원소 출력 ==> 행과 열의 번호

In [ ]:
for row in range(df1.shape[0]):
    print(row)
    for col in range(df1.shape[1]):
        print(row,col, df1.iloc[row,col])

0
0 0 11
0 1 22
0 2 33
1
1 0 44
1 1 55
1 2 66
2
2 0 77
2 1 88
2 2 99

- loc를 활용한 모든 원소 출력 ==> 행 레이블/이름과 열 레이블/이름

In [ ]:
df1.index, df1.columns

(Index(['one', 'two', 'three'], dtype='object'),
 Index(['A', 'B', 'C'], dtype='object'))

In [ ]:
for row in df1.index:
    print(row)
    for col in df1.columns:
        print('----',col,df1.loc[row,col])

one
---- A 11
---- B 22
---- C 33
two
---- A 44
---- B 55
---- C 66
three
---- A 77
---- B 88
---- C 99

### [문제] one, three 행을 선택 후 저장

In [ ]:
onethree = df1.iloc[0],df1.iloc[2]
onethree

(A    11
 B    22
 C    33
 Name: one, dtype: int64,
 A    77
 B    88
 C    99
 Name: three, dtype: int64)

In [ ]:
onethreeDF=df1.loc[['one','three']]
type(onethreeDF), onethreeDF

(pandas.core.frame.DataFrame,
         A   B   C
 one    11  22  33
 three  77  88  99)

In [ ]:
df1.loc[['one']] # 데이터 프레임

      A   B   C
one  11  22  33